/* automatically generated by rust-bindgen 0.71.1 */

use crate::ffi;

unsafe extern "C" {
    pub fn cuda_convert_lwe_ciphertext_vector_to_gpu_64(
        stream: *mut ffi::c_void,
        gpu_index: u32,
        dest: *mut ffi::c_void,
        src: *const ffi::c_void,
        number_of_cts: u32,
        lwe_dimension: u32,
    );
}
unsafe extern "C" {
    pub fn cuda_convert_lwe_ciphertext_vector_to_cpu_64(
        stream: *mut ffi::c_void,
        gpu_index: u32,
        dest: *mut ffi::c_void,
        src: *const ffi::c_void,
        number_of_cts: u32,
        lwe_dimension: u32,
    );
}
unsafe extern "C" {
    pub fn cuda_glwe_sample_extract_64(
        stream: *mut ffi::c_void,
        gpu_index: u32,
        lwe_array_out: *mut ffi::c_void,
        glwe_array_in: *const ffi::c_void,
        nth_array: *const u32,
        num_nths: u32,
        lwe_per_glwe: u32,
        glwe_dimension: u32,
        polynomial_size: u32,
    );
}
unsafe extern "C" {
    pub fn cuda_modulus_switch_inplace_64(
        stream: *mut ffi::c_void,
        gpu_index: u32,
        lwe_array_out: *mut ffi::c_void,
        size: u32,
        log_modulus: u32,
    );
}
unsafe extern "C" {
    pub fn cuda_modulus_switch_64(
        stream: *mut ffi::c_void,
        gpu_index: u32,
        lwe_out: *mut ffi::c_void,
        lwe_in: *const ffi::c_void,
        size: u32,
        log_modulus: u32,
    );
}
unsafe extern "C" {
    pub fn cuda_centered_modulus_switch_64(
        stream: *mut ffi::c_void,
        gpu_index: u32,
        lwe_out: *mut ffi::c_void,
        lwe_in: *const ffi::c_void,
        lwe_dimension: u32,
        log_modulus: u32,
    );
}
unsafe extern "C" {
    pub fn cuda_glwe_sample_extract_128(
        stream: *mut ffi::c_void,
        gpu_index: u32,
        lwe_array_out: *mut ffi::c_void,
        glwe_array_in: *const ffi::c_void,
        nth_array: *const u32,
        num_nths: u32,
        lwe_per_glwe: u32,
        glwe_dimension: u32,
        polynomial_size: u32,
    );
}
pub const PBS_TYPE_MULTI_BIT: PBS_TYPE = 0;
pub const PBS_TYPE_CLASSICAL: PBS_TYPE = 1;
pub type PBS_TYPE = ffi::c_uint;
pub const PBS_MS_REDUCTION_T_NO_REDUCTION: PBS_MS_REDUCTION_T = 0;
pub const PBS_MS_REDUCTION_T_CENTERED: PBS_MS_REDUCTION_T = 1;
pub type PBS_MS_REDUCTION_T = ffi::c_uint;
pub const SHIFT_OR_ROTATE_TYPE_LEFT_SHIFT: SHIFT_OR_ROTATE_TYPE = 0;
pub const SHIFT_OR_ROTATE_TYPE_RIGHT_SHIFT: SHIFT_OR_ROTATE_TYPE = 1;
pub const SHIFT_OR_ROTATE_TYPE_LEFT_ROTATE: SHIFT_OR_ROTATE_TYPE = 2;
pub const SHIFT_OR_ROTATE_TYPE_RIGHT_ROTATE: SHIFT_OR_ROTATE_TYPE = 3;
pub type SHIFT_OR_ROTATE_TYPE = ffi::c_uint;
pub const BITOP_TYPE_BITAND: BITOP_TYPE = 0;
pub const BITOP_TYPE_BITOR: BITOP_TYPE = 1;
pub const BITOP_TYPE_BITXOR: BITOP_TYPE = 2;
pub const BITOP_TYPE_SCALAR_BITAND: BITOP_TYPE = 3;
pub const BITOP_TYPE_SCALAR_BITOR: BITOP_TYPE = 4;
pub const BITOP_TYPE_SCALAR_BITXOR: BITOP_TYPE = 5;
pub type BITOP_TYPE = ffi::c_uint;
pub const COMPARISON_TYPE_EQ: COMPARISON_TYPE = 0;
pub const COMPARISON_TYPE_NE: COMPARISON_TYPE = 1;
pub const COMPARISON_TYPE_GT: COMPARISON_TYPE = 2;
pub const COMPARISON_TYPE_GE: COMPARISON_TYPE = 3;
pub const COMPARISON_TYPE_LT: COMPARISON_TYPE = 4;
pub const COMPARISON_TYPE_LE: COMPARISON_TYPE = 5;
pub const COMPARISON_TYPE_MAX: COMPARISON_TYPE = 6;
pub const COMPARISON_TYPE_MIN: COMPARISON_TYPE = 7;
pub type COMPARISON_TYPE = ffi::c_uint;
pub const Direction_Trailing: Direction = 0;
pub const Direction_Leading: Direction = 1;
pub type Direction = ffi::c_uint;
pub const BitValue_Zero: BitValue = 0;
pub const BitValue_One: BitValue = 1;
pub type BitValue = ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CudaStreamsFFI {
    pub streams: *const *mut ffi::c_void,
    pub gpu_indexes: *const u32,
    pub gpu_count: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CudaStreamsFFI"][::std::mem::size_of::<CudaStreamsFFI>() - 24usize];
    ["Alignment of CudaStreamsFFI"][::std::mem::align_of::<CudaStreamsFFI>() - 8usize];
    ["Offset of field: CudaStreamsFFI::streams"]
        [::std::mem::offset_of!(CudaStreamsFFI, streams) - 0usize];
    ["Offset of field: CudaStreamsFFI::gpu_indexes"]
        [::std::mem::offset_of!(CudaStreamsFFI, gpu_indexes) - 8usize];
    ["Offset of field: CudaStreamsFFI::gpu_count"]
        [::std::mem::offset_of!(CudaStreamsFFI, gpu_count) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CudaRadixCiphertextFFI {
    pub ptr: *mut ffi::c_void,
    pub degrees: *mut u64,
    pub noise_levels: *mut u64,
    pub num_radix_blocks: u32,
    pub max_num_radix_blocks: u32,
    pub lwe_dimension: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CudaRadixCiphertextFFI"][::std::mem::size_of::<CudaRadixCiphertextFFI>() - 40usize];
    ["Alignment of CudaRadixCiphertextFFI"]
        [::std::mem::align_of::<CudaRadixCiphertextFFI>() - 8usize];
    ["Offset of field: CudaRadixCiphertextFFI::ptr"]
        [::std::mem::offset_of!(CudaRadixCiphertextFFI, ptr) - 0usize];
    ["Offset of field: CudaRadixCiphertextFFI::degrees"]
        [::std::mem::offset_of!(CudaRadixCiphertextFFI, degrees) - 8usize];
    ["Offset of field: CudaRadixCiphertextFFI::noise_levels"]
        [::std::mem::offset_of!(CudaRadixCiphertextFFI, noise_levels) - 16usize];
    ["Offset of field: CudaRadixCiphertextFFI::num_radix_blocks"]
        [::std::mem::offset_of!(CudaRadixCiphertextFFI, num_radix_blocks) - 24usize];
    ["Offset of field: CudaRadixCiphertextFFI::max_num_radix_blocks"]
        [::std::mem::offset_of!(CudaRadixCiphertextFFI, max_num_radix_blocks) - 28usize];
    ["Offset of field: CudaRadixCiphertextFFI::lwe_dimension"]
        [::std::mem::offset_of!(CudaRadixCiphertextFFI, lwe_dimension) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CudaScalarDivisorFFI {
    pub chosen_multiplier_has_at_least_one_set: *const u64,
    pub decomposed_chosen_multiplier: *const u64,
    pub num_scalars: u32,
    pub active_bits: u32,
    pub shift_pre: u64,
    pub shift_post: u32,
    pub ilog2_chosen_multiplier: u32,
    pub chosen_multiplier_num_bits: u32,
    pub is_chosen_multiplier_zero: bool,
    pub is_abs_chosen_multiplier_one: bool,
    pub is_chosen_multiplier_negative: bool,
    pub is_chosen_multiplier_pow2: bool,
    pub chosen_multiplier_has_more_bits_than_numerator: bool,
    pub is_chosen_multiplier_geq_two_pow_numerator: bool,
    pub ilog2_divisor: u32,
    pub is_divisor_zero: bool,
    pub is_abs_divisor_one: bool,
    pub is_divisor_negative: bool,
    pub is_divisor_pow2: bool,
    pub divisor_has_more_bits_than_numerator: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CudaScalarDivisorFFI"][::std::mem::size_of::<CudaScalarDivisorFFI>() - 64usize];
    ["Alignment of CudaScalarDivisorFFI"][::std::mem::align_of::<CudaScalarDivisorFFI>() - 8usize];
    ["Offset of field: CudaScalarDivisorFFI::chosen_multiplier_has_at_least_one_set"][::std::mem::offset_of!(
        CudaScalarDivisorFFI,
        chosen_multiplier_has_at_least_one_set
    ) - 0usize];
    ["Offset of field: CudaScalarDivisorFFI::decomposed_chosen_multiplier"]
        [::std::mem::offset_of!(CudaScalarDivisorFFI, decomposed_chosen_multiplier) - 8usize];
    ["Offset of field: CudaScalarDivisorFFI::num_scalars"]
        [::std::mem::offset_of!(CudaScalarDivisorFFI, num_scalars) - 16usize];
    ["Offset of field: CudaScalarDivisorFFI::active_bits"]
        [::std::mem::offset_of!(CudaScalarDivisorFFI, active_bits) - 20usize];
    ["Offset of field: CudaScalarDivisorFFI::shift_pre"]
        [::std::mem::offset_of!(CudaScalarDivisorFFI, shift_pre) - 24usize];
    ["Offset of field: CudaScalarDivisorFFI::shift_post"]
        [::std::mem::offset_of!(CudaScalarDivisorFFI, shift_post) - 32usize];
    ["Offset of field: CudaScalarDivisorFFI::ilog2_chosen_multiplier"]
        [::std::mem::offset_of!(CudaScalarDivisorFFI, ilog2_chosen_multiplier) - 36usize];
    ["Offset of field: CudaScalarDivisorFFI::chosen_multiplier_num_bits"]
        [::std::mem::offset_of!(CudaScalarDivisorFFI, chosen_multiplier_num_bits) - 40usize];
    ["Offset of field: CudaScalarDivisorFFI::is_chosen_multiplier_zero"]
        [::std::mem::offset_of!(CudaScalarDivisorFFI, is_chosen_multiplier_zero) - 44usize];
    ["Offset of field: CudaScalarDivisorFFI::is_abs_chosen_multiplier_one"]
        [::std::mem::offset_of!(CudaScalarDivisorFFI, is_abs_chosen_multiplier_one) - 45usize];
    ["Offset of field: CudaScalarDivisorFFI::is_chosen_multiplier_negative"]
        [::std::mem::offset_of!(CudaScalarDivisorFFI, is_chosen_multiplier_negative) - 46usize];
    ["Offset of field: CudaScalarDivisorFFI::is_chosen_multiplier_pow2"]
        [::std::mem::offset_of!(CudaScalarDivisorFFI, is_chosen_multiplier_pow2) - 47usize];
    ["Offset of field: CudaScalarDivisorFFI::chosen_multiplier_has_more_bits_than_numerator"][::std::mem::offset_of!(
        CudaScalarDivisorFFI,
        chosen_multiplier_has_more_bits_than_numerator
    )
        - 48usize];
    ["Offset of field: CudaScalarDivisorFFI::is_chosen_multiplier_geq_two_pow_numerator"][::std::mem::offset_of!(
        CudaScalarDivisorFFI,
        is_chosen_multiplier_geq_two_pow_numerator
    )
        - 49usize];
    ["Offset of field: CudaScalarDivisorFFI::ilog2_divisor"]
        [::std::mem::offset_of!(CudaScalarDivisorFFI, ilog2_divisor) - 52usize];
    ["Offset of field: CudaScalarDivisorFFI::is_divisor_zero"]
        [::std::mem::offset_of!(CudaScalarDivisorFFI, is_divisor_zero) - 56usize];
    ["Offset of field: CudaScalarDivisorFFI::is_abs_divisor_one"]
        [::std::mem::offset_of!(CudaScalarDivisorFFI, is_abs_divisor_one) - 57usize];
    ["Offset of field: CudaScalarDivisorFFI::is_divisor_negative"]
        [::std::mem::offset_of!(CudaScalarDivisorFFI, is_divisor_negative) - 58usize];
    ["Offset of field: CudaScalarDivisorFFI::is_divisor_pow2"]
        [::std::mem::offset_of!(CudaScalarDivisorFFI, is_divisor_pow2) - 59usize];
    ["Offset of field: CudaScalarDivisorFFI::divisor_has_more_bits_than_numerator"][::std::mem::offset_of!(
        CudaScalarDivisorFFI,
        divisor_has_more_bits_than_numerator
    ) - 60usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CudaLweCiphertextListFFI {
    pub ptr: *mut ffi::c_void,
    pub num_radix_blocks: u32,
    pub lwe_dimension: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CudaLweCiphertextListFFI"]
        [::std::mem::size_of::<CudaLweCiphertextListFFI>() - 16usize];
    ["Alignment of CudaLweCiphertextListFFI"]
        [::std::mem::align_of::<CudaLweCiphertextListFFI>() - 8usize];
    ["Offset of field: CudaLweCiphertextListFFI::ptr"]
        [::std::mem::offset_of!(CudaLweCiphertextListFFI, ptr) - 0usize];
    ["Offset of field: CudaLweCiphertextListFFI::num_radix_blocks"]
        [::std::mem::offset_of!(CudaLweCiphertextListFFI, num_radix_blocks) - 8usize];
    ["Offset of field: CudaLweCiphertextListFFI::lwe_dimension"]
        [::std::mem::offset_of!(CudaLweCiphertextListFFI, lwe_dimension) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CudaPackedGlweCiphertextListFFI {
    pub ptr: *mut ffi::c_void,
    pub storage_log_modulus: u32,
    pub lwe_per_glwe: u32,
    pub total_lwe_bodies_count: u32,
    pub glwe_dimension: u32,
    pub polynomial_size: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CudaPackedGlweCiphertextListFFI"]
        [::std::mem::size_of::<CudaPackedGlweCiphertextListFFI>() - 32usize];
    ["Alignment of CudaPackedGlweCiphertextListFFI"]
        [::std::mem::align_of::<CudaPackedGlweCiphertextListFFI>() - 8usize];
    ["Offset of field: CudaPackedGlweCiphertextListFFI::ptr"]
        [::std::mem::offset_of!(CudaPackedGlweCiphertextListFFI, ptr) - 0usize];
    ["Offset of field: CudaPackedGlweCiphertextListFFI::storage_log_modulus"]
        [::std::mem::offset_of!(CudaPackedGlweCiphertextListFFI, storage_log_modulus) - 8usize];
    ["Offset of field: CudaPackedGlweCiphertextListFFI::lwe_per_glwe"]
        [::std::mem::offset_of!(CudaPackedGlweCiphertextListFFI, lwe_per_glwe) - 12usize];
    ["Offset of field: CudaPackedGlweCiphertextListFFI::total_lwe_bodies_count"]
        [::std::mem::offset_of!(CudaPackedGlweCiphertextListFFI, total_lwe_bodies_count) - 16usize];
    ["Offset of field: CudaPackedGlweCiphertextListFFI::glwe_dimension"]
        [::std::mem::offset_of!(CudaPackedGlweCiphertextListFFI, glwe_dimension) - 20usize];
    ["Offset of field: CudaPackedGlweCiphertextListFFI::polynomial_size"]
        [::std::mem::offset_of!(CudaPackedGlweCiphertextListFFI, polynomial_size) - 24usize];
};
unsafe extern "C" {
    pub fn scratch_cuda_apply_univariate_lut_64(
        streams: CudaStreamsFFI,
        mem_ptr: *mut *mut i8,
        input_lut: *const ffi::c_void,
        lwe_dimension: u32,
        glwe_dimension: u32,
        polynomial_size: u32,
        ks_level: u32,
        ks_base_log: u32,
        pbs_level: u32,
        pbs_base_log: u32,
        grouping_factor: u32,
        input_lwe_ciphertext_count: u32,
        message_modulus: u32,
        carry_modulus: u32,
        pbs_type: PBS_TYPE,
        lut_degree: u64,
        allocate_gpu_memory: bool,
        noise_reduction_type: PBS_MS_REDUCTION_T,
    ) -> u64;
}
unsafe extern "C" {
    pub fn scratch_cuda_apply_many_univariate_lut_64(
        streams: CudaStreamsFFI,
        mem_ptr: *mut *mut i8,
        input_lut: *const ffi::c_void,
